<?php
/**************************************************
機能削除
**************************************************/
// jQueryの二重読み込み回避（wp_head()で自動に読み込まれる既存のjQueryを削除）
function wp_delete_local_jquery() {
    wp_deregister_script('jquery');
}
add_action( 'wp_enqueue_scripts','wp_delete_local_jquery' );
// WordPressのバージョン情報削除
remove_action('wp_head','wp_generator');
// WordPressの絵文字機能を削除
remove_action('wp_head','print_emoji_detection_script',7);
remove_action('wp_print_styles','print_emoji_styles',10);
// Windows Live Writerからの投稿機能を削除
remove_action('wp_head','wlwmanifest_link');
// 外部の投稿ツールからの投稿機能を削除
remove_action('wp_head','rsd_link');
/**************************************************
機能追加
**************************************************/

/**************************************************
SEO対策
**************************************************/
//OGP情報の自動出力

//記事別のSEOタイトル・SEOディスクリプション

//canonical設定

//Ping設定

/**************************************************
セキュリティ対策（HTMLのエスケープ処理）
**************************************************/

/**************************************************
管理画面
**************************************************/
//アイキャッチ機能の追加

//記事一覧ページよりアイキャッチを追加

//サイト内アクセス解析機能

//記事別のPV数管理機能

/**************************************************
ページ全体
**************************************************/
//Lazyload(画像最適化)

/**************************************************
トップページ
**************************************************/
//サイトの新着情報の追加

//記事ディスクリプションの表示文字数調整

//概要（抜粋）の省略文字を三点リーダーに変更

/**************************************************
記事ページ
**************************************************/
//ブログカードの追加

//SEOタイトルの文字数カウント

/**************************************************
ウィジェット（ウィジェットエリア）追加
**************************************************/

/**************************************************
カスタムメニュー追加
**************************************************/

/**************************************************
外部コンテンツの自動レスポンシブ化
**************************************************/

?>